### 1

In [1]:
import pandas as pd
import numpy as np

In [2]:
exam_data  = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

df = pd.DataFrame(exam_data , index=labels)
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   name      10 non-null     object
 1   score     8 non-null      float64
 2   attempts  10 non-null     int64
 3   qualify   10 non-null     object
dtypes: float64(1), int64(1), object(2)
memory usage: 400.0+ bytes

In [4]:
df.iloc[:3]

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes

In [5]:
df.head(3)

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes

In [6]:
df[['name','score']][:4]

        name  score
a  Anastasia   12.5
b       Dima    9.0
c  Katherine   16.5
d      James    NaN

In [7]:
print("Select specific columns and rows:")
df.iloc[[1, 3, 5, 6], [1, 3]]

Select specific columns and rows:

   score qualify
b    9.0      no
d    NaN      no
f   20.0     yes
g   14.5     yes

In [8]:
print("Number of attempts in the examination is greater than 2:")
df[df['attempts'] > 2]

Number of attempts in the examination is greater than 2:

      name  score  attempts qualify
b     Dima    9.0         3      no
d    James    NaN         3      no
f  Michael   20.0         3     yes

#### count the number of rows and columns

In [9]:
total_rows=len(df.axes[0])
total_cols=len(df.axes[1])
print("Number of Rows: "+str(total_rows))
print("Number of Columns: "+str(total_cols))

Number of Rows: 10
Number of Columns: 4

In [10]:
print(f"Number of Rows: {df.shape[0]}")
print(f"Number of Columns: {df.shape[1]}")

Number of Rows: 10
Number of Columns: 4

#### select the rows where the score is missing

In [11]:
print("Rows where score is missing:")
df[df['score'].isnull()]

Rows where score is missing:

    name  score  attempts qualify
d  James    NaN         3      no
h  Laura    NaN         1      no

####  select the rows the score is between 15 and 20 (inclusive)

In [12]:
df[df['score'].between(15, 20)]

        name  score  attempts qualify
c  Katherine   16.5         2     yes
f    Michael   20.0         3     yes
j      Jonas   19.0         1     yes

In [13]:
df[(df['score']>=15) & (df['score']<=20)]

        name  score  attempts qualify
c  Katherine   16.5         2     yes
f    Michael   20.0         3     yes
j      Jonas   19.0         1     yes

#### select the rows where number of attempts in the examination is less than 2 and score greater than 15

In [14]:
df[(df['attempts'] < 2) & (df['score'] > 15)]

    name  score  attempts qualify
j  Jonas   19.0         1     yes

#### change the score in row 'd' to 11.5

In [15]:
print("\nOriginal data frame:")
print(df)
print("\nChange the score in row 'd' to 11.5:")
df.loc['d', 'score'] = 11.5
df

Original data frame:
        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

Change the score in row 'd' to 11.5:

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James   11.5         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

#### sum of the examination attempts by the students

In [16]:
df['attempts'].sum()

19

In [17]:
sum(df.attempts)

19

#### mean score for each different student in DataFrame

In [18]:
np.mean(df['score'])

13.333333333333334

In [19]:
mean = df['score'].mean()

In [20]:
"{:.2f}".format(mean)

'13.33'

In [21]:
"{:.3f}".format(mean)

'13.333'

In [22]:
"{:.2f}%".format(mean)

'13.33%'

#### append a new row 'k' to data frame

In [23]:
print("\nAppend a new row:")
df.loc['k'] = [1, 'Suresh', 'yes', 15.5]
df

Append a new row:

        name   score attempts qualify
a  Anastasia    12.5        1     yes
b       Dima       9        3      no
c  Katherine    16.5        2     yes
d      James    11.5        3      no
e      Emily       9        2      no
f    Michael      20        3     yes
g    Matthew    14.5        1     yes
h      Laura     NaN        1      no
i      Kevin       8        2      no
j      Jonas      19        1     yes
k          1  Suresh      yes    15.5

In [24]:
df = df.drop('k')
df

        name score attempts qualify
a  Anastasia  12.5        1     yes
b       Dima     9        3      no
c  Katherine  16.5        2     yes
d      James  11.5        3      no
e      Emily     9        2      no
f    Michael    20        3     yes
g    Matthew  14.5        1     yes
h      Laura   NaN        1      no
i      Kevin     8        2      no
j      Jonas    19        1     yes

#### sort the DataFrame first by 'name' in descending order, then by 'score' in ascending order

In [25]:
df.sort_values(by=['name', 'score'], ascending=[False, True])

        name score attempts qualify
f    Michael    20        3     yes
g    Matthew  14.5        1     yes
h      Laura   NaN        1      no
i      Kevin     8        2      no
c  Katherine  16.5        2     yes
j      Jonas    19        1     yes
d      James  11.5        3      no
e      Emily     9        2      no
b       Dima     9        3      no
a  Anastasia  12.5        1     yes

#### replace the 'qualify' column contains the values 'yes' and 'no' with True and False

In [26]:
print("\nReplace the 'qualify' column contains the values 'yes' and 'no'  with True and  False:")
df['qualify'] = df['qualify'].map({'yes': True, 'no': False})
df

Replace the 'qualify' column contains the values 'yes' and 'no'  with True and  False:

        name score attempts  qualify
a  Anastasia  12.5        1     True
b       Dima     9        3    False
c  Katherine  16.5        2     True
d      James  11.5        3    False
e      Emily     9        2    False
f    Michael    20        3     True
g    Matthew  14.5        1     True
h      Laura   NaN        1    False
i      Kevin     8        2    False
j      Jonas    19        1     True

#### change the name 'James' to 'Suresh' in name column of the DataFrame

In [27]:
df['name'] = df['name'].replace('James', 'Suresh')
df

        name score attempts  qualify
a  Anastasia  12.5        1     True
b       Dima     9        3    False
c  Katherine  16.5        2     True
d     Suresh  11.5        3    False
e      Emily     9        2    False
f    Michael    20        3     True
g    Matthew  14.5        1     True
h      Laura   NaN        1    False
i      Kevin     8        2    False
j      Jonas    19        1     True

#### delete the 'attempts' column from the DataFrame

In [28]:
df.pop('attempts')
df

        name score  qualify
a  Anastasia  12.5     True
b       Dima     9    False
c  Katherine  16.5     True
d     Suresh  11.5    False
e      Emily     9    False
f    Michael    20     True
g    Matthew  14.5     True
h      Laura   NaN    False
i      Kevin     8    False
j      Jonas    19     True

#### insert a new column in existing DataFrame

In [29]:
exam_data  = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df = pd.DataFrame(exam_data , index=labels)
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [30]:
color = ['Red','Blue','Orange','Red','White','White','Blue','Green','Green','Red']
df['color'] = color
df

        name  score  attempts qualify   color
a  Anastasia   12.5         1     yes     Red
b       Dima    9.0         3      no    Blue
c  Katherine   16.5         2     yes  Orange
d      James    NaN         3      no     Red
e      Emily    9.0         2      no   White
f    Michael   20.0         3     yes   White
g    Matthew   14.5         1     yes    Blue
h      Laura    NaN         1      no   Green
i      Kevin    8.0         2      no   Green
j      Jonas   19.0         1     yes     Red

#### iterate over rows in a DataFrame

In [31]:
for index, row in df.iterrows():
    print(row['name'], row['score'])

Anastasia 12.5
Dima 9.0
Katherine 16.5
James nan
Emily 9.0
Michael 20.0
Matthew 14.5
Laura nan
Kevin 8.0
Jonas 19.0

#### get list from DataFrame column headers

In [32]:
list(df.columns.values)

['name', 'score', 'attempts', 'qualify', 'color']

#### rename columns of a given DataFrame

In [33]:
d = {'col1': [1, 2, 3], 'col2': [4, 5, 6], 'col3': [7, 8, 9]}
df = pd.DataFrame(data=d)
print("Original DataFrame")
df

Original DataFrame

   col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6     9

In [34]:
df.columns = ['Column1', 'Column2', 'Column3']
df = df.rename(columns={'col1': 'Column1', 'col2': 'Column2', 'col3': 'Column3'})
print("New DataFrame after renaming columns:")
df

New DataFrame after renaming columns:

   Column1  Column2  Column3
0        1        4        7
1        2        5        8
2        3        6        9

#### select rows from a given DataFrame based on values in some columns

In [35]:
d = {'col1': [1, 4, 3, 4, 5], 'col2': [4, 5, 6, 7, 8], 'col3': [7, 8, 9, 0, 1]}
df = pd.DataFrame(data=d)
df

   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1

In [36]:
df.loc[df['col1'] == 4]

   col1  col2  col3
1     4     5     8
3     4     7     0

#### change the order of a DataFrame columns

In [37]:
df[['col3', 'col2', 'col1']]

   col3  col2  col1
0     7     4     1
1     8     5     4
2     9     6     3
3     0     7     4
4     1     8     5

#### add one row in an existing DataFrame

In [38]:
df2 = {'col1': 10, 'col2': 11, 'col3': 12}
df = df.append(df2, ignore_index=True)
df

   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1
5    10    11    12

#### count city wise number of people from a given of data set

In [39]:

df1 = pd.DataFrame({'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'city': ['California', 'Los Angeles', 'California', 'California', 'California', 'Los Angeles', 'Los Angeles', 'Georgia', 'Georgia', 'Los Angeles']})
g1 = df1.groupby(["city"]).size().reset_index(name='Number of people')
g1

          city  Number of people
0   California                 4
1      Georgia                 2
2  Los Angeles                 4

#### delete DataFrame row(s) based on given column value

In [40]:
df = df[df.col2 != 5]
print("New DataFrame")
df

New DataFrame

   col1  col2  col3
0     1     4     7
2     3     6     9
3     4     7     0
4     5     8     1
5    10    11    12

#### widen output display to see more columns

In [41]:
pd.set_option('display.max_rows', 50)
pd.set_option('display.max_columns', 50)
pd.set_option('display.width', 200)
df

   col1  col2  col3
0     1     4     7
2     3     6     9
3     4     7     0
4     5     8     1
5    10    11    12

#### select a row of series/dataframe by given integer index

In [42]:
result = df.iloc[[2]]
print("Index-2: Details")
result

Index-2: Details

   col1  col2  col3
3     4     7     0

#### replace all the NaN values with Zero's in a column of a dataframe

In [43]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
df = pd.DataFrame(exam_data)

df

        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3      James    NaN         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    NaN         1      no
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes

In [44]:
df =  df.fillna(0)
df

        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3      James    0.0         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    0.0         1      no
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes

#### convert index in a column of the given dataframe.

In [45]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
df = pd.DataFrame(exam_data)
df.reset_index(level=0, inplace=True)
df

   index       name  score  attempts qualify
0      0  Anastasia   12.5         1     yes
1      1       Dima    9.0         3      no
2      2  Katherine   16.5         2     yes
3      3      James    NaN         3      no
4      4      Emily    9.0         2      no
5      5    Michael   20.0         3     yes
6      6    Matthew   14.5         1     yes
7      7      Laura    NaN         1      no
8      8      Kevin    8.0         2      no
9      9      Jonas   19.0         1     yes

In [46]:
df.loc[0]

index               0
name        Anastasia
score            12.5
attempts            1
qualify           yes
Name: 0, dtype: object

#### set a given value for particular cell in  DataFrame using index value

In [47]:
df

   index       name  score  attempts qualify
0      0  Anastasia   12.5         1     yes
1      1       Dima    9.0         3      no
2      2  Katherine   16.5         2     yes
3      3      James    NaN         3      no
4      4      Emily    9.0         2      no
5      5    Michael   20.0         3     yes
6      6    Matthew   14.5         1     yes
7      7      Laura    NaN         1      no
8      8      Kevin    8.0         2      no
9      9      Jonas   19.0         1     yes

In [48]:
print("\nSet a given value for particular cell in the DataFrame")

df.at[8,'score']=100
df

Set a given value for particular cell in the DataFrame

   index       name  score  attempts qualify
0      0  Anastasia   12.5         1     yes
1      1       Dima    9.0         3      no
2      2  Katherine   16.5         2     yes
3      3      James    NaN         3      no
4      4      Emily    9.0         2      no
5      5    Michael   20.0         3     yes
6      6    Matthew   14.5         1     yes
7      7      Laura    NaN         1      no
8      8      Kevin  100.0         2      no
9      9      Jonas   19.0         1     yes

#### count the NaN values in one or more columns in DataFrame

In [49]:
df.isnull().values.sum()

2

#### drop a list of rows from a specified DataFrame

In [50]:
df = df.drop(df.index[[2,4]])
df

   index       name  score  attempts qualify
0      0  Anastasia   12.5         1     yes
1      1       Dima    9.0         3      no
3      3      James    NaN         3      no
5      5    Michael   20.0         3     yes
6      6    Matthew   14.5         1     yes
7      7      Laura    NaN         1      no
8      8      Kevin  100.0         2      no
9      9      Jonas   19.0         1     yes

#### reset index in a given DataFrame.

In [51]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
df = pd.DataFrame(exam_data)

print("Original DataFrame")
df

Original DataFrame

        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3      James    NaN         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    NaN         1      no
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes

In [52]:
print("\nAfter removing first and second rows")
df = df.drop([0, 1])
df

After removing first and second rows

        name  score  attempts qualify
2  Katherine   16.5         2     yes
3      James    NaN         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    NaN         1      no
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes

In [53]:
print("\nReset the Index:")
df = df.reset_index()
df

Reset the Index:

   index       name  score  attempts qualify
0      2  Katherine   16.5         2     yes
1      3      James    NaN         3      no
2      4      Emily    9.0         2      no
3      5    Michael   20.0         3     yes
4      6    Matthew   14.5         1     yes
5      7      Laura    NaN         1      no
6      8      Kevin    8.0         2      no
7      9      Jonas   19.0         1     yes

#### devide a DataFrame in a given ratio

In [54]:
s1 = pd.Series(['100', '200', 'python', '300.12', '400'])
s2 = pd.Series(['10', '20', 'php', '30.12', '40'])
print("Data Series:")
s1

Data Series:

0       100
1       200
2    python
3    300.12
4       400
dtype: object

In [55]:
s2

0       10
1       20
2      php
3    30.12
4       40
dtype: object

In [56]:
df = pd.concat([s1, s2], axis=1)
print("New DataFrame combining two series:")
df

New DataFrame combining two series:

        0      1
0     100     10
1     200     20
2  python    php
3  300.12  30.12
4     400     40

#### shuffle a given DataFrame rows

In [57]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
df = pd.DataFrame(exam_data)
df

        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3      James    NaN         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    NaN         1      no
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes

In [58]:
# 

df = df.sample(frac=1)
df

        name  score  attempts qualify
7      Laura    NaN         1      no
9      Jonas   19.0         1     yes
3      James    NaN         3      no
8      Kevin    8.0         2      no
0  Anastasia   12.5         1     yes
4      Emily    9.0         2      no
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
6    Matthew   14.5         1     yes
5    Michael   20.0         3     yes

#### 41. Write a Pandas program to convert DataFrame column type from string to datetime.

In [59]:
s = pd.Series(['3/11/2000', '3/12/2000', '3/13/2000'])
s

0    3/11/2000
1    3/12/2000
2    3/13/2000
dtype: object

In [60]:
r = pd.to_datetime(pd.Series(s))
df = pd.DataFrame(r)
df

           0
0 2000-03-11
1 2000-03-12
2 2000-03-13

#### 42. Write a Pandas program to rename a specific column name in a given DataFrame.

In [61]:
d = {'col1': [1, 2, 3], 'col2': [4, 5, 6], 'col3': [7, 8, 9]}
df = pd.DataFrame(data=d)
print("Original DataFrame")
df

Original DataFrame

   col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6     9

In [62]:
df=df.rename(columns = {'col2':'Column2'})
list(df.columns)

['col1', 'Column2', 'col3']

#### get a list of a specified column of a DataFrame.

In [65]:
lst = df["col1"].tolist()
lst

[1, 2, 3]

#### get the specified row value of a given DataFrame

In [66]:
print("Value of Row1")
df.iloc[0]

Value of Row1

col1       1
Column2    4
col3       7
Name: 0, dtype: int64

In [68]:
print("Value of Row4")
df.iloc[2]

Value of Row4

col1       3
Column2    6
col3       9
Name: 2, dtype: int64

#### get the datatypes of columns of a DataFrame

In [69]:
df.dtypes

col1       int64
Column2    int64
col3       int64
dtype: object

#### append data to an empty DataFrame

In [70]:
df = pd.DataFrame()
data = pd.DataFrame({"col1": range(3),"col2": range(3)})
print("After appending some data:")
df = df.append(data)
df

After appending some data:

   col1  col2
0     0     0
1     1     1
2     2     2

#### convert the datatype of a given column

In [74]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9.1, 16.5, 12.77, 9.21, 20.22, 14.5, 11.34, 8.8, 19.13],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
df = pd.DataFrame(exam_data)
df

        name  score  attempts qualify
0  Anastasia  12.50         1     yes
1       Dima   9.10         3      no
2  Katherine  16.50         2     yes
3      James  12.77         3      no
4      Emily   9.21         2      no
5    Michael  20.22         3     yes
6    Matthew  14.50         1     yes
7      Laura  11.34         1      no
8      Kevin   8.80         2      no
9      Jonas  19.13         1     yes

In [75]:
df.dtypes

name         object
score       float64
attempts      int64
qualify      object
dtype: object

In [76]:
df.score = df.score.astype(int)
df.dtypes

name        object
score        int32
attempts     int64
qualify     object
dtype: object

#### group by the first column and get second column as lists in rows.

In [77]:
df = pd.DataFrame( {'col1':['C1','C1','C2','C2','C2','C3','C2'], 'col2':[1,2,3,3,4,6,5]})
print("Original DataFrame")
df

Original DataFrame

  col1  col2
0   C1     1
1   C1     2
2   C2     3
3   C2     3
4   C2     4
5   C3     6
6   C2     5

In [78]:
df = df.groupby('col1')['col2'].apply(list)
df

col1
C1          [1, 2]
C2    [3, 3, 4, 5]
C3             [6]
Name: col2, dtype: object

#### Write a Pandas program to select all columns, except one given column in a DataFrame.

In [79]:
d = {'col1': [1, 2, 3, 4, 7], 'col2': [4, 5, 6, 9, 5], 'col3': [7, 8, 12, 1, 11]}
df = pd.DataFrame(data=d)
print("Original DataFrame")
df

Original DataFrame

   col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6    12
3     4     9     1
4     7     5    11

In [80]:
print("\nAll columns except 'col3':")
df = df.loc[:, df.columns != 'col3']
df

All columns except 'col3':

   col1  col2
0     1     4
1     2     5
2     3     6
3     4     9
4     7     5

#### Write a Pandas program to get topmost n records within each group of a DataFrame.

In [81]:
d = {'col1': [1, 2, 3, 4, 7, 11], 'col2': [4, 5, 6, 9, 5, 0], 'col3': [7, 5, 8, 12, 1,11]}
df = pd.DataFrame(data=d)
print("Original DataFrame")
df

Original DataFrame

   col1  col2  col3
0     1     4     7
1     2     5     5
2     3     6     8
3     4     9    12
4     7     5     1
5    11     0    11

In [82]:
print("\ntopmost n records within each group of a DataFrame:")
df1 = df.nlargest(2, 'col1')
df1

topmost n records within each group of a DataFrame:

   col1  col2  col3
5    11     0    11
4     7     5     1

In [83]:
df2 = df.nlargest(3, 'col2')
df2

   col1  col2  col3
3     4     9    12
2     3     6     8
1     2     5     5

In [84]:
df3 = df.nlargest(3, 'col3')
df3

   col1  col2  col3
3     4     9    12
5    11     0    11
2     3     6     8

#### Write a Pandas program to add a prefix or suffix to all columns of a given DataFrame.

In [90]:
df = pd.DataFrame({'W':[68,75,86,80,66],'X':[78,85,96,80,86], 'Y':[84,94,89,83,86],'Z':[86,97,96,72,83]});
print("Original DataFrame")
df

Original DataFrame

    W   X   Y   Z
0  68  78  84  86
1  75  85  94  97
2  86  96  89  96
3  80  80  83  72
4  66  86  86  83

In [91]:
print("\nAdd prefix:")
df.add_prefix("A_")

Add prefix:

   A_W  A_X  A_Y  A_Z
0   68   78   84   86
1   75   85   94   97
2   86   96   89   96
3   80   80   83   72
4   66   86   86   83

In [92]:
print("\nAdd suffix:")
df.add_suffix("_1")

Add suffix:

   W_1  X_1  Y_1  Z_1
0   68   78   84   86
1   75   85   94   97
2   86   96   89   96
3   80   80   83   72
4   66   86   86   83

#### Write a Pandas program to select columns by data type of a given DataFrame

In [93]:
df = pd.DataFrame({
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Syed Wharton'],
    'date_of_birth': ['17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'age': [18.5, 21.2, 22.5, 22, 23]
})

df

             name date_of_birth   age
0  Alberto Franco    17/05/2002  18.5
1    Gino Mcneill    16/02/1999  21.2
2     Ryan Parkes    25/09/1998  22.5
3    Eesha Hinton    11/05/2002  22.0
4    Syed Wharton    15/09/1997  23.0

In [94]:
print("\nSelect numerical columns")
df.select_dtypes(include = "number")

Select numerical columns

    age
0  18.5
1  21.2
2  22.5
3  22.0
4  23.0

In [95]:
print("\nSelect string columns")
df.select_dtypes(include = "object")

Select string columns

             name date_of_birth
0  Alberto Franco    17/05/2002
1    Gino Mcneill    16/02/1999
2     Ryan Parkes    25/09/1998
3    Eesha Hinton    11/05/2002
4    Syed Wharton    15/09/1997

#### Write a Pandas program to rename all columns with the same pattern of a given DataFrame.

In [96]:
df = pd.DataFrame({
    'Name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Syed Wharton'],
    'Date_Of_Birth ': ['17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'Age': [18.5, 21.2, 22.5, 22, 23]
})

print("Original DataFrame")
df

Original DataFrame

             Name Date_Of_Birth    Age
0  Alberto Franco     17/05/2002  18.5
1    Gino Mcneill     16/02/1999  21.2
2     Ryan Parkes     25/09/1998  22.5
3    Eesha Hinton     11/05/2002  22.0
4    Syed Wharton     15/09/1997  23.0

In [97]:
df.columns = df.columns.str.lower().str.rstrip()
print("\nRemove trailing (at the end) whitesapce and convert to lowercase of the columns name")
df.head()

Remove trailing (at the end) whitesapce and convert to lowercase of the columns name

             name date_of_birth   age
0  Alberto Franco    17/05/2002  18.5
1    Gino Mcneill    16/02/1999  21.2
2     Ryan Parkes    25/09/1998  22.5
3    Eesha Hinton    11/05/2002  22.0
4    Syed Wharton    15/09/1997  23.0

#### Write a Pandas program to merge datasets and check uniqueness.

In [98]:
df = pd.DataFrame({
    'Name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Syed Wharton'],
    'Date_Of_Birth ': ['17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'Age': [18.5, 21.2, 22.5, 22, 23]
})
print("Original DataFrame:")
print(df)
df1 = df.copy(deep = True)
df = df.drop([0, 1])
df1 = df1.drop([2])
print("\nNew DataFrames:")
print(df)
print(df1)

Original DataFrame:
             Name Date_Of_Birth    Age
0  Alberto Franco     17/05/2002  18.5
1    Gino Mcneill     16/02/1999  21.2
2     Ryan Parkes     25/09/1998  22.5
3    Eesha Hinton     11/05/2002  22.0
4    Syed Wharton     15/09/1997  23.0

New DataFrames:
           Name Date_Of_Birth    Age
2   Ryan Parkes     25/09/1998  22.5
3  Eesha Hinton     11/05/2002  22.0
4  Syed Wharton     15/09/1997  23.0
             Name Date_Of_Birth    Age
0  Alberto Franco     17/05/2002  18.5
1    Gino Mcneill     16/02/1999  21.2
3    Eesha Hinton     11/05/2002  22.0
4    Syed Wharton     15/09/1997  23.0

In [99]:
print('\n"one_to_one: check if merge keys are unique in both left and right datasets:"')
df_one_to_one = pd.merge(df, df1, validate = "one_to_one")
df_one_to_one

"one_to_one: check if merge keys are unique in both left and right datasets:"

           Name Date_Of_Birth    Age
0  Eesha Hinton     11/05/2002  22.0
1  Syed Wharton     15/09/1997  23.0

In [100]:
print('\n"one_to_many or 1:m: check if merge keys are unique in left dataset:')
df_one_to_many = pd.merge(df, df1, validate = "one_to_many")
df_one_to_many

"one_to_many or 1:m: check if merge keys are unique in left dataset:

           Name Date_Of_Birth    Age
0  Eesha Hinton     11/05/2002  22.0
1  Syed Wharton     15/09/1997  23.0

In [101]:
print('many_to_one or m:1: check if merge keys are unique in right dataset:')
df_many_to_one = pd.merge(df, df1, validate = "many_to_one")
df_many_to_one

many_to_one or m:1: check if merge keys are unique in right dataset:

           Name Date_Of_Birth    Age
0  Eesha Hinton     11/05/2002  22.0
1  Syed Wharton     15/09/1997  23.0

#### Write a Pandas program to convert continuous values of a column in a given DataFrame to categorical.

In [105]:
df = pd.DataFrame({
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Syed Wharton', 'Kierra Gentry'],
      'age': [18, 22, 85, 50, 80, 5]
})

df

             name  age
0  Alberto Franco   18
1    Gino Mcneill   22
2     Ryan Parkes   85
3    Eesha Hinton   50
4    Syed Wharton   80
5   Kierra Gentry    5

In [106]:
df["age_groups"] = pd.cut(df["age"], bins = [0, 18, 65, 99], labels = ["kids", "adult", "elderly"])
df

             name  age age_groups
0  Alberto Franco   18       kids
1    Gino Mcneill   22      adult
2     Ryan Parkes   85    elderly
3    Eesha Hinton   50      adult
4    Syed Wharton   80    elderly
5   Kierra Gentry    5       kids

#### Write a Pandas program to combine many given series to create a DataFrame.

In [107]:
sr1 = pd.Series(['php', 'python', 'java', 'c#', 'c++'])
sr2 = pd.Series([1, 2, 3, 4, 5])
sr1

0       php
1    python
2      java
3        c#
4       c++
dtype: object

In [108]:
sr2

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [110]:
print("\nUsing pandas concat:")
ser_df = pd.concat([sr1, sr2], axis = 1)
ser_df

Using pandas concat:

        0  1
0     php  1
1  python  2
2    java  3
3      c#  4
4     c++  5

In [111]:
ser_df = pd.DataFrame({"col1":sr1, "col2":sr2})
ser_df

     col1  col2
0     php     1
1  python     2
2    java     3
3      c#     4
4     c++     5